Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Обработчик на основании вычисляемых коэффициентов корреляции выявляет взаимосвязь между рядами данных входного набора.
en: The handler detects interrelation between the series of the input data set based on the calculated correlation coefficients.

source: Обработчик осуществляет экспорт исходного набора в базу данных.
en: The handler exports the initial data set to database.

source: Обработчик осуществляет экспорт исходного набора данных в LGD-файл.
en: The handler exports the initial data set to the LGD file.

source: Обработчик позволяет вычислять автокорреляцию временных рядов, количество отсчетов выбирается пользователем.
en: The handler enables to calculate autocorrelation of time series, the lag count is selected by a user.

source: Обработчик позволяет объединять записи избранных полей в группы, а для оставшихся полей вычислять статистические показатели (сумму, среднее, минимум и т.д.).
en: The handler enables to combine records of the selected fields into groups, and to calculate the statistical indicators for the remaining fields (sum, mean, minimum, etc).

source: Обработчик позволяет преобразовать табличные данные в переменные.
en: The handler enables to convert the table data to variables.

source: Обработчик предназначен для автоматической корректировки выбросов и экстремальных значений в наборах данных.
en: The handler is designated for automatic elimination of outliers and extreme values in data sets.

source: Обработчик предназначен для импорта таблицы из LGD-файла.
en: The handler is designated for the table import from the LGD file.

source: Обработчик предназначен для математических операций над переменными.
en: The handler is designated for mathematical operations with variables.

source: Обработчик предназначен для объединения двух или более наборов переменных в один набор.
en: The handler is designated for combination of two and more sets of variables into one set.

source: Обработчик предназначен для сглаживания численных рядов данных и выделения трендовой составляющей.
en: The handler is designated for smoothing of numerical data series and selection of trend story.

source: Обработчик предназначен для транспонирования таблицы.
en: The handler is designated for the table transportation.

source: Обработчик преобразовывает список переменных в таблицу.
en: The handler transforms the list of variables to table.

source: Обработчик преобразует данные, представленные в иерархической древовидной форме, в таблицу.
en: The handler transforms the data represented in the hierarchic tree-like form to table.

source: Обработчик применяется с целью понижения размерности пространства факторов.
en: The handler is used in order to decrease dimension of factors space.

source: Обработчик производит кластеризацию объектов на основе алгоритмов k-means и g-means.
en: The handler performs clustering of objects on the basis of k-means and g-means algorithms.

source: Обработчик разбивает диапазон значений выбранных полей исходного набора на конечное число интервалов.
en: The handler bins values range of the selected fields of the source data set to the final bin count.

source: Обработчик реализует различные способы отбора записей в выборку из исходного набора данных.
en: The handler uses different methods to select records for the sample from the source data set.

source: Обработчик создает сводную таблицу на основе исходного набора.
en: The handler creates the pivot table based on the source data set.

source: Обработчик экспортирует таблицы данных в файлы для программы Microsoft Excel.
en: The handler exports the table data to the files for Microsoft Excel.

source: Обработчики этой группы позволяют проводить различные операции над ними: изменение, создание переменных из таблицы, расчет новых переменных с помощью различных функций.
en: The handlers related to this group enable to perform different operations with them, namely, change, creation of variables from the table, calculation of the new variables using different functions.

source: Обработчики, выделенные в эту группу, являются инструментами для реализации различных методов Data Mining: кластеризация, ассоциативные правила и другие.
en: The handlers related to this group represent the tools for implementation of different Data Mining methods: clustering, association rules, etc.

source: Обратная кавычка (`).
en: Back quote (`)

source: Обратный слэш (&#92;).
en: Back slash (&#92;)

source: Обращение к источнику данных порта происходит через его номер:
en: The port data source is accessed by its number:

source: Обращение к созданному сервису
en: Access to the Created Service

source: Обучение вручную
en: Manual Training

source: Обучение вручную осуществляется при создании (редактировании) Сценариев.
en: The manual training is used when creating (editing) Workflows.

source: Обучение повторяется K раз, при этом на каждой итерации для валидации используется новая колода.
en: The training process is repeated K times, and a new fold is used for the validation purposes for each iteration.

source: Обучение повторяется в соответствии с заданным количеством итераций ресемплинга, при этом для каждой итерации формируется новое валидационное множество (ресемпл).
en: The training process is repeated according to the set count of resampling iterations, and a new validation set (resample) is generated for each iteration.

source: Обучение сети происходит итерационно.
en: The network is trained in the iterative manner.

source: Обучение(переобучение) узлов может производиться:
en: Training (retraining) of the nodes can be performed as follows:

source: Общая\_длина - длина результирующей строки
en: Total\_length - length of the resulting string.

source: Общее число примеров, поданных на вход модели
en: Total number of the samples supplied to the model input

source: Общее:
en: General:

source: Общие параметры
en: Common Parameters

source: Общий вид диаграммы представлен на Рис.
en: The general chart view is provided on Figure

source: Объединение является аналогом операции UNION в SQL.
en: The union is an analogue of the UNION operation in SQL.

source: Объединяет несколько строк в одну.
en: Combines several strings into one.

source: Объект
en: Object

source: Объект должен быть отнесен к тому кластеру, для которого данная вероятность выше.
en: The object must relate to the cluster for which this likelihood is higher.

source: Объект модуля имеет свойства parent, loaded и filename (как в NodeJS);
en: The module object has parent, loaded and filename (as in NodeJS) properties.

source: Объектами, для которых можно задать модификатор доступа, являются подключения и узлы Сценария.
en: The objects for which it is possible to set the access modifier are connections and nodes of the Workflow.

source: Объекты внутри кластера должны быть похожими друг на друга и отличаться от других, которые вошли в другие кластеры.
en: Objects inside the cluster must be similar to each other and differ from the other ones not included into other clusters.

source: Обычно в компаниях этим занимается ограниченное количество опытных аналитиков.
en: As a rule, a limited number of experienced analysts hold responsibility for this task in companies.

source: Обычно результатом выполнения пакета при этом является формирование итоговых данных и передача их в стороннюю систему (например, в хранилище данных или другую учетную систему).
en: As a rule, in this case, the batch processing result is generation of the summarized data and its transfer to the external system (for example, to the data warehouse or another accounting system).

source: Обычное.
en: Normal.

source: Обязательные поля:
en: Required fields:

source: Обязательный
en: Required

source: Обязательный параметр.
en: Required parameter.

source: Ограничение на значение выходов
en: Output Value Limit

source: Ограничений на тип данных в этих полях нет, вид данных может быть любой, кроме Неопределённого.
en: There are no restrictions for the data type in these fields, any data kind is allowed, with the exception of the Undefined one.

source: Ограничивать
en: Limit

source: Ограничивать максимальное количество итераций следует в случае большого количества данных для предварительной оценки качества кластеризации.
en: It is required to limit the maximum number of iterations in the case of large amount of data for preliminary evaluation of the clustering quality.

source: Один из предшествующих узлов не выполняется.
en: One of the preceding nodes is not executed.

source: Один скрытый слой (используется по умолчанию).
en: One hidden layer (used by default).

source: Один скрытый слой (используется по умолчанию);
en: One hidden layer (used by default).

source: Одинаковые значения поля (полей) будут сгруппированы таким же образом, как это происходит в обработчике Группировка.
en: The similar field (fields) values will be grouped in the same manner as it is organized in the Grouping handler.

source: Одинаковые плитки — достижение равного количества значений в интервалах обеспечивается не только подбором диапазонов интервалов, но и подбором типов границ для каждого интервала (> или >=).
en: Assign optimal: the equal number of values in bins is provided not only by selecting bin ranges, but also by selecting types of bounds for each bin (> or >=).

source: Одинарная кавычка (');
en: Single quote (')

source: Однако не всегда удается встроить универсальный компонент в конкретный сценарий без внесения в него изменений.
en: However, it is not always possible to insert the universal component into particular workflow without introduction of changes into it.

source: Однако, в случае, если алгоритм предусматривает многократное использование промежуточных данных, эта стратегия может приводить к увеличению времени выполнения алгоритма.
en: However, if the algorithm provides for multiple use of the intermediate data, this strategy can cause increase of the algorithm execution time.

source: Однако, если данных недостаточно или процедура "сэмплинга" при формировании обучающего множества была произведена неудачно, один из классов может оказаться доминирующим.
en: However, if there is no sufficient data or the "sampling" procedure was unsuccessfully performed when selecting the training set, one of the classes can become dominating.

source: Однако, иногда последовательность обработки данных не может быть задана таким образом.
en: However, sometimes it is not possible to set the data processing order in such a way.

source: Однако, модель самого базового узла останется неизменной.
en: However, the base node model will be unchanged.

source: Однако, порт "Переменные пользователя" в этом случае содержит собственный набор переменных, применимых только внутри Подмодели.
en: However, in this case, the "User variables" port contains its own set of variables used only inside the Supernode.

source: Однако, сама реализация логики расчетов от него скрыта.
en: However, the calculation logics is hidden from him.

source: Одно из состояний бинарной целевой переменной класса
en: One of the states of the binary target class variable

source: Одной из основных концепций, на которых базируется платформа Loginom, является Сценарий.
en: One of the main concepts on which the Loginom platform is based is the Workflow.

source: Однострочный комментарий начинается символами // (два слеша) и продолжается до конца строки.
en: The single-line comment starts from // (two slashes) characters, and it continues until the end of the string.

source: Однострочный комментарий — начинается символами // (два слеша) и продолжается до конца строки;
en: The single-line comment starts from // (two slashes) characters, and it continues until the end of the string.

source: Окно Инспектора свойств расположено в правой части экрана на страницах Сценарий и Подключения и по умолчанию находится в свернутом состоянии.
en: The Property inspector window is located in the right part of the screen on the Workflow and Connections pages. It is collapsed by default.

source: Окно имеет два поля.
en: The window includes two fields.

source: Окно мастера настройки содержит список полей входной таблицы, для каждого поля имеются настраиваемые параметры:
en: The wizard window contains a list of the input table fields. The following configured features are available for each field:

source: Окно мастера настройки состоит из 2-х областей: Поле и Разбиение.
en: The wizard window consists of two areas: Field and Time frames.

source: Окно мастера настройки состоит из 3-х областей:
en: The wizard window consists of three areas:

source: Окно мастера настройки состоит из трех областей.
en: The wizard window consists of three areas.

source: Окно мастера поделено на две области.
en: The wizard window is divided into two areas.

source: Окно мастера поделено на две области:
en: The wizard window is divided into two areas:

source: Окно мастера поделено на две области: доступные поля (слева) и выбранные поля (справа).
en: The wizard window is divided into two areas: available fields (to the left) and selected fields (to the right).

source: Окно настроек можно открыть с панели инструментов или двойным щелчком левой кнопки мыши в области построения диаграммы.
en: It is possible to open the configuration window using the toolbar or by double clicking on the charting area with the left mouce button.

source: Окно настроек содержит области:
en: The wizard window includes the following areas:

source: Окно настройки
en: Configuration window

source: Окно настройки вычисляемого факта представлено на Рис.1 и условно разделено на 3 области.
en: The configuration window of the calculated measure is represented on Figure 1, and it is conventionally divided into 3 areas.

source: Окно настройки состоит их двух частей: настройка списка серий (добавление, удаление, перемещение) и настройка параметров каждой серии.
en: The configuration window consists of two parts: configuration of the series list (add, delete, move) and configuration of each series parameters.

source: Округляет вещественное число до ближайшего числа, имеющего указанное количество цифр после запятой.
en: Rounds up the real number to the nearest number that has the specified number of digits following the decimal point.

source: Он включает левую панель, где отображаются рабочие компоненты и структура решения (пакеты и их составные части), а также непосредственно область построения сценария и визуализации данных.
en: It contains the left panel where working components, solution structure (packages and their parts), area of workflow construction and data visualization are displayed.

source: Он может манипулировать отчетами: изменять их вид, группировать данные, настраивать фильтры, менять типы графиков.
en: He can handle the reports: change their kind, group data, configure filters, change types of graphic charts.

source: Он может разрабатывать логику обработки, создавать веб-сервисы, реализовывать и делиться собственными компонентами, подключаться к внешним источникам и прочее.
en: He can develop the processing logics, create web services, implement and share his own components, connect to the external sources, etc.

source: Он оперирует привычными терминами бизнес-среды, например, такими как: отгрузка, товар, клиент.
en: Familiar business environment terms are used in it. For example, shipment, goods, client.

source: Он описывает определенное действие, например, продажи товара, отгрузки и прочее.
en: It describes a definite action, for example, sale of goods, shipments, etc.

source: Он позволяет импортировать таблицу БД или результаты выполнения SQL-запроса, заданного пользователем, а также представление — view.
en: It allows for import of the database table or results of execution of the SQL query set by the user and view.

source: Он представляет собой комбинацию узлов обработки данных, настраиваемую пользователем для решения конкретной задачи.
en: It is a combination of data processing nodes configured by a user to solve a particular task.

source: Он реализован поверх реляционной базы данных.
en: It has been implemented over the relational database.

source: Он сводится к выбору новой ортогональной системы координат в пространстве наблюдений.
en: It comes down to selection of the new orthogonal frame of reference in the observation space.

source: Оно появляется тогда, когда отбираются факты.
en: It appears when measures are selected.

source: Операторы сравнения:
en: Comparisons operator:

source: Операции
en: Operations

source: Операции панели инструментов и контекстного меню:
en: There are the following toolbar and context menu operations:

source: Описание
en: Description

source: Описание коэффициентов представлено в таблице:
en: Description of coefficients is provided in the table:

source: Описание дополнительных команд мастера:
en: Description of the Additional Wizard Commands:

source: Описание значений всех столбцов приведено в таблице:
en: The values of all columns are stated in the table:

source: Описание настроек диаграммы приведено выше в данной статье.
en: The chart settings are described above in this article.

source: Описание ошибки — описание кодов завершения.
en: Error description: the description of exit codes.

source: Описание параметров
en: Description of Parameters

source: Описание перечислений
en: Description of Enumerations

source: Описание показателей модели представлено в таблице:
en: Description of model indicators is represented in the table:

source: Описание узла
en: Node Description

source: Опорное значение
en: Reference Value

source: Опорное значение не используется.
en: The reference value is not used.

source: Определим корреляцию товара "Спагетти" с остальными товарами на основе коэффициентов Пирсона (в мастере настройки обработчика поле "Спагетти" отметим в "Наборе 1", а остальные товары - в "Наборе 2").
en: Let's define correlation of the "Spaghetti" item of goods with other goods based on the Pearson coefficients (it is required to mark the "Spaghetti" field in "Set 1" and other goods in "Set 2" in the handler wizard).

source: Определяет размер скользящего окна для сглаживания исходного ряда.
en: It defines the lag size for the source series smoothing.

source: Определяет число предыдущих значений ряда, учитываемых при построении модели.
en: It sets the number of the previous series values that are considered when constructing the model.

source: Определяет способ разбиения диапазона изменения входного признака на классы (интервалы).
en: It defines the method of partitioning of the input indicator variation range into classes (bins).

source: Определяется по формуле $$\mathsf{\frac{TP+TN}{TP+TN+FP+FN}}$$
en: It is defined using the following formula: $$\mathsf{\frac{TP+TN}{TP+TN+FP+FN}}$$

source: Определяется целью и логикой решаемой задачи.
en: It is defined by the objective and logics of the performed task.

source: Определяют настройки для работы с внешними источниками и приемниками данных.
en: They define configuration for work with external sources and data receivers.

source: Опубликованный
en: Published

source: Опции аналогичны настройкам Тип авторизации из Параметры подключения.
en: Options are similar to Authorization Type settings from Connection parameters.

source: Опция автоматической синхронизации отключается при удалении пользователем любого из полей/переменных выходного набора порта.
en: The automatic synchronization option is disabled when any of the fields/variables of the output data set of the port is deleted by a user.

source: Орловская обл.
en: The Orel Region

source: Основание - числовое выражение;
en: Basis - numeric expression;

source: Основное назначение Подмодели:
en: The Main Designation of the Supernode:

source: Основное отличие одного алгоритма от другого в том, известно ли заранее количество кластеров.
en: The main difference of one algorithm from the other one lies in the fact whether the number of clusters is known in advance or not.

source: Основной кейс использования — Производные компоненты.
en: The main usage case is Derived Components.

source: Основные понятия
en: Basic Terms

source: Особенности применения внешних модулей
en: Features of External Modules Usage

source: Особенностью подобного подхода является проектирование «сверху вниз» — от общей постановки задачи к отдельным подзадачам.
en: The "top-down" design (from the general assignment of a task to separate subtasks) is typical of such approach.

source: Особенностью применения данной конструкции подстановки является то, что в запрос через переменные могут передаваться значения только простых типов данных: логический, строковый, числовой, дата/время.
en: When this substitution construction is used, only simple data types can be passed to the query via variables: logical, string, numeric, date/time.

source: Особенностью производного компонента являются его следующие свойства:
en: The following properties are peculiar to the derived component:

source: Оставить без изменения
en: Leave unchanged

source: Оставить без изменения — выявленные пропуски заполняться не будут;
en: Leave unchanged: detected null data will not be filled in.

source: Оставить как есть — границы всех интервалов будут иметь тип >=, и возможна ситуация, когда совпадающие значения окажутся в разных интервалах.
en: Leave as is: bounds of all bins will be related to >= type, and matching values can be in different bins.

source: Останется пустой.
en: It will remain null.

source: Ось — расположение оси Y относительно диаграммы.
en: Axis: location of Y axis relative to the chart.

source: От обработчика к обработчику могут передаваться как наборы данных - таблицы, так и переменные - объекты, содержащие лишь одно значение.
en: Both data sets, tables, and variables, objects containing only one value can be transferred from handler to handler.

source: Отдельный случай останова оптимизатора — если достигнут теоретически наилучший результат.
en: The optimizer is stopped in some specific cases if, from a theoretical standpoint, the best result is reached.

source: Отключение проверки соединения может привести к блокировки пакетов сервером, т.к. сервер не сможет определить разрыв связи с клиентом и будет считать, что пакет все еще используется клиентом.
en: The disabled connection check can cause locking of packages by the server as the server will not be able to detect the loss of connection with the client, and it will be decided that the package is still being used by the client.

source: Отключить автосинхронизацию полей и при необходимости задать нужные поля/переменные (рекомендуется).
en: It is required to disable Automapping of fields and set the required fields/variables (recommended) when applicable.

source: Откроется диалог "Настройка соответствия между столбцами" или "Настройка соответствия между переменными" в зависимости от типа порта.
en: "Configure columns mapping" or "Adjustment of variables mapping" dialog will be opened according to the port type.

source: Откроется мастер публикации пакетов со следующими настройками:
en: It will enable to open the package publication wizard with the following settings:

source: Откроется новое окно с информацией о версии (типа Loginom X.X.X, где X.X.X – номер версии).
en: The new window with the version information will be opened (for example, Loginom X.X.X where X.X.X is a version number).

source: Откроется окно "Добавление ссылки на пакет";
en: "Add reference to package" window will be opened;

source: Откроется окно Настройка производного компонента, где определяются:
en: Configuration of the derived component window where the following parameters are defined will be opened:

source: Откроется окно «Добавление ссылки на пакет»;
en: "Add reference to package" window will be opened;

source: Откроется окно выбора настроек:
en: The window of settings selection will be opened:
